import 'package:flutter/cupertino.dart';
import 'package:tehnotop/constants/screens.dart';

class Policy extends StatefulWidget {
  @override
  _PolicyState createState() => _PolicyState();
}

class _PolicyState extends State<Policy> {

  @override
  void initState() {
    super.initState();
  }

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        titleSpacing: 0.0,
        leading: IconButton(
          onPressed: () => Navigator.pop(context),
          icon: Icon(Icons.arrow_back_ios),
        ),
        title: Text(
          'Політика компанії',
          style: darkBlueColor17SemiBoldTextStyle,
        ),
      ),
      body: ListView(
        physics: BouncingScrollPhysics(parent: AlwaysScrollableScrollPhysics()),
        padding: EdgeInsets.symmetric(horizontal: fixPadding * 2.0),
        children: [
          title('Конфіденційність'),
          heightSpace,
          textPolicy(),
          heightSpace,
          heightSpace,
          title('Персональні дані'),
          heightSpace,
          textPersonalData(),
        ],
      ),
    );
  }

  title(String title) {
    return Text(
      title,
      style: darkBlueColor14SemiBoldTextStyle,
    );
  }

  titleWithOnTap({String title, Function onTap}) {
    return InkWell(
      onTap: onTap,
      child: Text(
        title,
        style: darkBlueColor14SemiBoldTextStyle,
      ),
    );
  }

  textPolicy() {
    return Text(''
        '1. Конфіденційною за цим Договором визнається інформація яка відповідно '
        'до чинного законодавства є конфіденційною інформацією (інформацією з обмеженим доступом). \n \n'
        '2. Адміністрація сайту використовує інформацію про Користувача (Покупця) з метою виконання Замовлень Користувача (Покупця), якщо інше не визначено цими Правилами.',
      style: greyColor13RegularTextStyle,
    );
  }

  textPersonalData() {
    return Text(''
        '1. Під час заповнення реєстраційної форми в додатку та оформленні '
        'замовлення товару (товарів) Користувач (Покупець) добровільно дає згоду '
        'на збір і обробку своїх персональних даних шляхом проставлення відмітки  '
        'про надання дозволу на обробку своїх персональних даних. \n \n'
        '2. Обробка персональних даних Користувача (Покупця) здійснюється '
        'Адміністрацією з наступною метою: для обробки та виконання  '
        'Замовлень на придбання Товарів (послуг), отримання інформації про замовлення, '
        'відправки телекомунікаційними засобами зв\'язку (електронною поштою, '
        'мобільним зв\'язком тощо) рекламних та спеціальних пропозицій, '
        'інформації про акції, розіграші або будь-яку іншу інформацію про '
        'діяльність додатку, з метою здійснення маркетингових досліджень,  '
        'в інших комерційних цілях. \n \n'
        '3. Надаючи згоду на  збір і обробку своїх персональних даних в '
        'порядку визначеному пунктом 1. цих Правил, Користувач (Покупець) '
        'надає згоду на поширення (передачу) своїх даних Продавцям, транспортно-експедиторським '
        'і кур\'єрським організаціям, будь-яким Банкам і / або фінансовим '
        'установам з метою виконання Замовлення на придбання Товарів (послуг). \n \n'
        '4. Для цілей, передбачених цим розділом, Адміністрація має право надсилати '
        'листи, повідомлення та матеріали на поштову адресу, e-mail Користувача (Покупця), '
        'а також надсилати sms-повідомлення, здійснювати дзвінки на вказаний в '
        'анкеті номер, якщо це необхідно для виконання замовлення Користувача '
        '(Покупця). \n \n'
        '5. Якщо Користувач (Покупець) продовжує користуватись цим додатком, '
        'це означає його згоду на використання додатком (cookies) та отримання '
        'Користувачем (Покупцем) всіх файлів cookie. \n Файли cookie використовують '
        'для того, щоб підвищувати якість послуг, що надаються, зокрема для '
        'швидкої ідентифікації Користувача (Покупця), збереження налаштувань '
        'Користувача (Покупця), його персональних уподобань, відстеження '
        'стану сесії доступу Відвідувача (Покупця) і характерних для нього '
        'тенденцій. Адміністрація також використовує файли cookie в рекламних '
        'цілях, зокрема щоб керувати оголошеннями на додатках у мережі Інтернет. '
        'Після вимкнення технології cookie Відвідувачем (Покупцем), '
        'Адміністрація не гарантує повної працездатності додатку.\n \n'
        '6. У разі небажання отримувати розсилання про рекламні акції, '
        'нові товари (послуги) тощо, Користувач (Покупець) має право '
        'відмовитися від неї, шляхом видалення мобільного додатку. \n \n'
        '7. Адміністрація не несе відповідальності за зміст і достовірність '
        'інформації, наданої Користувачем (Покупцем) під час реєстрації в додатку '
        'та оформленні Замовлення. Користувач (Покупець) несе відповідальність '
        'за достовірність зазначеної під час реєстрації в додатку та оформленні '
        'Замовлення інформації, погоджується на всі ризики (в тому числі додаткові '
        'витрати), пов\'язані з недостовірністю та/або неточністю такої інформації.',
      style: greyColor13RegularTextStyle,
    );
  }
}
